In [20]:
import pandas as pd
import numpy as np

In [21]:
labels = ['a', 'b', 'c']

minha_lista = [10, 20, 30]

arr = np.array([10, 20, 30])

d = {'a': 10, 'b': 20, 'c': 30}

In [22]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [23]:
pd.Series(data=labels, index=minha_lista)

10    a
20    b
30    c
dtype: object

In [24]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [25]:
ser1 = pd.Series([1, 2, 3, 4], ['USA', 'Germany', 'Russia', 'Japan'])

In [26]:
ser1

USA        1
Germany    2
Russia     3
Japan      4
dtype: int64

In [29]:
ser2 = pd.Series([1, 2, 5, 4], ['USA', 'Germany', 'Itália', 'Japan'])

In [30]:
ser2

USA        1
Germany    2
Itália     5
Japan      4
dtype: int64

In [31]:
ser1[['USA', 'Japan']]

USA      1
Japan    4
dtype: int64

In [32]:
ser1 + ser2

Germany    4.0
Itália     NaN
Japan      8.0
Russia     NaN
USA        2.0
dtype: float64

DataFrames

In [33]:
from numpy.random import randn

In [34]:
df = pd.DataFrame(randn(5, 4), index = ['A', 'B', 'C', 'D', 'E'], columns="W X Y Z".split())

In [35]:
df

          W         X         Y         Z
A -0.920943  0.358095 -0.523851  1.018199
B -0.153023  0.505581 -1.380209  0.783302
C  0.409794 -0.328918  0.298359  0.291174
D -0.260996 -1.158972 -0.790574 -2.212372
E  0.695898  0.873173  0.546568  0.574001

In [38]:
df[['W']]

          W
A -0.920943
B -0.153023
C  0.409794
D -0.260996
E  0.695898

In [42]:
df['New'] = df['W'] + df['Y']

In [43]:
df

          W         X         Y         Z       New
A -0.920943  0.358095 -0.523851  1.018199 -1.444794
B -0.153023  0.505581 -1.380209  0.783302 -1.533232
C  0.409794 -0.328918  0.298359  0.291174  0.708153
D -0.260996 -1.158972 -0.790574 -2.212372 -1.051570
E  0.695898  0.873173  0.546568  0.574001  1.242466

In [44]:
df.drop('New', axis=1)

          W         X         Y         Z
A -0.920943  0.358095 -0.523851  1.018199
B -0.153023  0.505581 -1.380209  0.783302
C  0.409794 -0.328918  0.298359  0.291174
D -0.260996 -1.158972 -0.790574 -2.212372
E  0.695898  0.873173  0.546568  0.574001

In [45]:
df

          W         X         Y         Z       New
A -0.920943  0.358095 -0.523851  1.018199 -1.444794
B -0.153023  0.505581 -1.380209  0.783302 -1.533232
C  0.409794 -0.328918  0.298359  0.291174  0.708153
D -0.260996 -1.158972 -0.790574 -2.212372 -1.051570
E  0.695898  0.873173  0.546568  0.574001  1.242466

In [46]:
df.drop('New', axis=1, inplace=True)

In [47]:
df

          W         X         Y         Z
A -0.920943  0.358095 -0.523851  1.018199
B -0.153023  0.505581 -1.380209  0.783302
C  0.409794 -0.328918  0.298359  0.291174
D -0.260996 -1.158972 -0.790574 -2.212372
E  0.695898  0.873173  0.546568  0.574001

In [48]:
df.loc[['A', 'B']]

          W         X         Y         Z
A -0.920943  0.358095 -0.523851  1.018199
B -0.153023  0.505581 -1.380209  0.783302

In [49]:
df.loc[['A']] #retorna um dataframe

          W         X         Y         Z
A -0.920943  0.358095 -0.523851  1.018199

In [ ]:
df.loc['A'] #retorna uma serie

In [50]:
df.iloc[0, 2]

-0.5238509317366232

In [51]:
df

          W         X         Y         Z
A -0.920943  0.358095 -0.523851  1.018199
B -0.153023  0.505581 -1.380209  0.783302
C  0.409794 -0.328918  0.298359  0.291174
D -0.260996 -1.158972 -0.790574 -2.212372
E  0.695898  0.873173  0.546568  0.574001

In [52]:
df.iloc[1:4, 1:3] #linha e coluna

          X         Y
B  0.505581 -1.380209
C -0.328918  0.298359
D -1.158972 -0.790574

In [53]:
df > 0

       W      X      Y      Z
A  False   True  False   True
B  False   True  False   True
C   True  False   True   True
D  False  False  False  False
E   True   True   True   True

In [54]:
df[df > 0]

          W         X         Y         Z
A       NaN  0.358095       NaN  1.018199
B       NaN  0.505581       NaN  0.783302
C  0.409794       NaN  0.298359  0.291174
D       NaN       NaN       NaN       NaN
E  0.695898  0.873173  0.546568  0.574001

In [55]:
df

          W         X         Y         Z
A -0.920943  0.358095 -0.523851  1.018199
B -0.153023  0.505581 -1.380209  0.783302
C  0.409794 -0.328918  0.298359  0.291174
D -0.260996 -1.158972 -0.790574 -2.212372
E  0.695898  0.873173  0.546568  0.574001

In [62]:
df['X'] > 0

A     True
B     True
C    False
D    False
E     True
Name: X, dtype: bool

In [63]:
df[df['X'] > 0]

          W         X         Y         Z
A -0.920943  0.358095 -0.523851  1.018199
B -0.153023  0.505581 -1.380209  0.783302
E  0.695898  0.873173  0.546568  0.574001

In [65]:
df [(df['X'] > 0) & (df['Y'] > 0)]

          W         X         Y         Z
E  0.695898  0.873173  0.546568  0.574001

In [66]:
df

          W         X         Y         Z
A -0.920943  0.358095 -0.523851  1.018199
B -0.153023  0.505581 -1.380209  0.783302
C  0.409794 -0.328918  0.298359  0.291174
D -0.260996 -1.158972 -0.790574 -2.212372
E  0.695898  0.873173  0.546568  0.574001

In [68]:
df.loc[['A', 'B'], ['W']] #Loc me retorna um dataframe

          W
A -0.920943
B -0.153023

In [72]:
df.iloc[0:2, :-3] #iloc me retorna uma serie

          W
A -0.920943
B -0.153023

In [73]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.920943  0.358095 -0.523851  1.018199
1     B -0.153023  0.505581 -1.380209  0.783302
2     C  0.409794 -0.328918  0.298359  0.291174
3     D -0.260996 -1.158972 -0.790574 -2.212372
4     E  0.695898  0.873173  0.546568  0.574001

In [74]:
df

          W         X         Y         Z
A -0.920943  0.358095 -0.523851  1.018199
B -0.153023  0.505581 -1.380209  0.783302
C  0.409794 -0.328918  0.298359  0.291174
D -0.260996 -1.158972 -0.790574 -2.212372
E  0.695898  0.873173  0.546568  0.574001

In [75]:
df.reset_index(inplace=True)

In [76]:
df

  index         W         X         Y         Z
0     A -0.920943  0.358095 -0.523851  1.018199
1     B -0.153023  0.505581 -1.380209  0.783302
2     C  0.409794 -0.328918  0.298359  0.291174
3     D -0.260996 -1.158972 -0.790574 -2.212372
4     E  0.695898  0.873173  0.546568  0.574001

In [79]:
df.set_index('index', inplace=True)

In [80]:
df

              W         X         Y         Z
index
A     -0.920943  0.358095 -0.523851  1.018199
B     -0.153023  0.505581 -1.380209  0.783302
C      0.409794 -0.328918  0.298359  0.291174
D     -0.260996 -1.158972 -0.790574 -2.212372
E      0.695898  0.873173  0.546568  0.574001

In [81]:
novoind = 'CA NY WY OR CO'.split()

In [83]:
df['novo_index'] = novoind

In [84]:
df

              W         X         Y         Z novo_index
index
A     -0.920943  0.358095 -0.523851  1.018199         CA
B     -0.153023  0.505581 -1.380209  0.783302         NY
C      0.409794 -0.328918  0.298359  0.291174         WY
D     -0.260996 -1.158972 -0.790574 -2.212372         OR
E      0.695898  0.873173  0.546568  0.574001         CO

In [85]:
df.reset_index().set_index('novo_index')

           index         W         X         Y         Z
novo_index
CA             A -0.920943  0.358095 -0.523851  1.018199
NY             B -0.153023  0.505581 -1.380209  0.783302
WY             C  0.409794 -0.328918  0.298359  0.291174
OR             D -0.260996 -1.158972 -0.790574 -2.212372
CO             E  0.695898  0.873173  0.546568  0.574001

Hierarquia de indices e indices multiplos

In [86]:
#Niveis de indices
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(outside, inside))

In [87]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [89]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [90]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [91]:
df = pd.DataFrame(np.random.randn(6, 2), index=hier_index, columns=['A', 'B'])
df

             A         B
G1 1 -0.458137 -0.490769
   2 -0.322464  0.155756
   3  0.061863 -0.653860
G2 1 -0.295615  0.071022
   2  0.237943  0.395694
   3  0.171870 -0.160979

In [95]:
df.loc['G1']

          A         B
1 -0.458137 -0.490769
2 -0.322464  0.155756
3  0.061863 -0.653860

In [96]:
df.loc['G1'].loc[1]

A   -0.458137
B   -0.490769
Name: 1, dtype: float64

In [99]:
df.index.names

FrozenList(['Grupo', 'Num'])

In [98]:
df.index.names = ['Grupo', 'Num']
df

                  A         B
Grupo Num
G1    1   -0.458137 -0.490769
      2   -0.322464  0.155756
      3    0.061863 -0.653860
G2    1   -0.295615  0.071022
      2    0.237943  0.395694
      3    0.171870 -0.160979

In [100]:
df.xs(1, level= 'Num') #xs me retorna o nivel de indice

              A         B
Grupo
G1    -0.458137 -0.490769
G2    -0.295615  0.071022

Manipulação de dados ausentes

In [101]:
import numpy as np
import pandas as pd

In [102]:
df = pd.DataFrame({'A': [1, 2, np.nan], 
                   'B': [5, np.nan, np.nan], 
                   'C': [1, 2, 3]})

In [103]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [108]:
df.dropna() #dropa linhas com valores ausentes

     A    B  C
0  1.0  5.0  1

In [113]:
df.dropna(axis=1, thresh=2) #dropa colunas com valores ausentes e mostra 2 valores por coluna

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [117]:
df.fillna('conteudo')

          A         B  C
0       1.0       5.0  1
1       2.0  conteudo  2
2  conteudo  conteudo  3

In [118]:
df['A'].fillna(value=df['A'].mean()) #substitui os valores ausentes pela media da coluna

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [120]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [119]:
df.ffill() #substitui os valores ausentes pelo valor anterior

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

GROUPBY

In [141]:
import pandas as pd
#Cria um dataframe com os dados de vendas de uma loja
data = {'Classe': ['Junior', 'Junior', 'Pleno', 'Pleno', 'Senior', 'Senior'],
        'Nome': ['Jorge', 'Carlos', 'Roberta', 'Patricia', 'Bruno', 'Vera'],
        'Venda': [200, 120, 340, 124, 243, 350]}

In [156]:
df = pd.DataFrame(data)
df

   Classe      Nome  Venda
0  Junior     Jorge    200
1  Junior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patricia    124
4  Senior     Bruno    243
5  Senior      Vera    350

In [144]:
group = df.groupby("Classe") #divide o dataframe por classe

In [147]:
group.sum(numeric_only=True)

        Venda
Classe
Junior    320
Pleno     464
Senior    593

In [148]:
group.mean(numeric_only=True) #media de cada coluna

        Venda
Classe
Junior  160.0
Pleno   232.0
Senior  296.5

In [151]:
df.groupby('Classe').min()

            Nome  Venda
Classe
Junior    Carlos    120
Pleno   Patricia    124
Senior     Bruno    243

In [152]:
df.groupby('Classe').max() #maximo valor de cada coluna

           Nome  Venda
Classe
Junior    Jorge    200
Pleno   Roberta    340
Senior     Vera    350

In [157]:
df2 = df.copy()

In [158]:
df

   Classe      Nome  Venda
0  Junior     Jorge    200
1  Junior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patricia    124
4  Senior     Bruno    243
5  Senior      Vera    350

In [159]:
df2['Venda'] = [150, 432, 190, 230, 410, 155] #altera o valor de venda

In [160]:
df

   Classe      Nome  Venda
0  Junior     Jorge    200
1  Junior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patricia    124
4  Senior     Bruno    243
5  Senior      Vera    350

In [161]:
df2

   Classe      Nome  Venda
0  Junior     Jorge    150
1  Junior    Carlos    432
2   Pleno   Roberta    190
3   Pleno  Patricia    230
4  Senior     Bruno    410
5  Senior      Vera    155

In [162]:
df3 = pd.concat([df, df2]) #concatena os dataframes

In [163]:
df3

   Classe      Nome  Venda
0  Junior     Jorge    200
1  Junior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patricia    124
4  Senior     Bruno    243
5  Senior      Vera    350
0  Junior     Jorge    150
1  Junior    Carlos    432
2   Pleno   Roberta    190
3   Pleno  Patricia    230
4  Senior     Bruno    410
5  Senior      Vera    155

In [165]:
df3.groupby(['Classe', 'Nome']).sum() #groupby com multi index

                 Venda
Classe Nome
Junior Carlos      552
       Jorge       350
Pleno  Patricia    354
       Roberta     530
Senior Bruno       653
       Vera        505

Merge, Concat e Join

In [167]:
import pandas as pd

In [168]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [169]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [170]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [171]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [172]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [173]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [174]:
pd.concat([df1, df2, df3]) #concatena os dataframes

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [175]:
pd.concat([df1,df2,df3], axis=1) #concatena os dataframes por coluna

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

OUTROS DATAFRAMES

In [176]:
esquerda = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
direita = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [177]:
esquerda

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [178]:
direita

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [182]:
pd.merge(esquerda, direita, how='inner', on='key') #merge inner

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [180]:
import pandas as pd

clientes = pd.DataFrame({
    'cliente_id': [1, 2, 3],
    'nome': ['Alice', 'Bob', 'Charlie']
})

pedidos = pd.DataFrame({
    'pedido_id': [101, 102, 103],
    'cliente_id': [1, 2, 1],
    'valor': [250, 150, 200]
})

resultado = pd.merge(clientes, pedidos, on='cliente_id')

In [181]:
resultado

   cliente_id   nome  pedido_id  valor
0           1  Alice        101    250
1           1  Alice        103    200
2           2    Bob        102    150

MESCLAR

In [183]:
esquerda = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
direita = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [184]:
esquerda

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [185]:
direita

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [186]:
pd.merge(esquerda, direita, on=['key1', 'key2']) #merge com multi index

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [187]:
pd.merge(esquerda, direita, how='outer', on=['key1', 'key2']) #merge outer

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K0  NaN  NaN   C3   D3
5   K2   K1   A3   B3  NaN  NaN

JOIN

In [189]:
esquerda = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

direita = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [190]:
esquerda

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [191]:
direita

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [193]:
esquerda.join(direita, how='outer') #join inner

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [194]:
esquerda.join(direita, how='left') #join inner

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

Operações no Pandas

In [196]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [197]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [198]:
df.memory_usage() #memoria utilizada por cada coluna

Index    132
col1      32
col2      32
col3      32
dtype: int64

Informações sobre valores exclusivos

In [200]:
df['col2'].unique() #Valores exclusivos

array([444, 555, 666], dtype=int64)

In [201]:
df['col2'].nunique() #Numero de valores exclusivos

3

In [202]:
df['col2'].value_counts() #Contagem de valores

col2
444    2
555    1
666    1
Name: count, dtype: int64

Aplicando Funções

In [205]:
def comp(x):
    return x**2 + 3

In [206]:
df['col1'].apply(comp) #Aplicando funções

0     4
1     7
2    12
3    19
Name: col1, dtype: int64

In [207]:
df['col1_cal'] = df['col1'].apply(comp) #Aplicando funções e criando uma nova coluna

In [208]:
df

   col1  col2 col3  col1_cal
0     1   444  abc         4
1     2   555  def         7
2     3   666  ghi        12
3     4   444  xyz        19

In [209]:
df['col1'].apply(lambda x: x**2 + 3) #Aplicando

0     4
1     7
2    12
3    19
Name: col1, dtype: int64

In [210]:
df['col1'].sum()

10

In [211]:
df['col1'].mean()

2.5

In [212]:
df['col1'].product()

24

In [216]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [218]:
dict_map = {'one':1,'two':2}

In [220]:
df['E'] = df['B'].map(dict_map) #Mapeando valores

In [221]:
df

     A    B  C  D  E
0  foo  one  x  1  1
1  foo  one  y  3  1
2  foo  two  x  2  2
3  bar  two  y  5  2
4  bar  one  x  4  1
5  bar  one  y  1  1

In [222]:
df.pivot_table(index='A', columns='B', values='D') #Tabela dinamica

B    one  two
A
bar  2.5  5.0
foo  2.0  2.0

Dados temporais

In [223]:
numero_de_dias = 100

In [224]:
datas = pd.date_range(start='1/1/2021', periods=numero_de_dias)

In [225]:
datas

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10', '2021-01-11', '2021-01-12',
               '2021-01-13', '2021-01-14', '2021-01-15', '2021-01-16',
               '2021-01-17', '2021-01-18', '2021-01-19', '2021-01-20',
               '2021-01-21', '2021-01-22', '2021-01-23', '2021-01-24',
               '2021-01-25', '2021-01-26', '2021-01-27', '2021-01-28',
               '2021-01-29', '2021-01-30', '2021-01-31', '2021-02-01',
               '2021-02-02', '2021-02-03', '2021-02-04', '2021-02-05',
               '2021-02-06', '2021-02-07', '2021-02-08', '2021-02-09',
               '2021-02-10', '2021-02-11', '2021-02-12', '2021-02-13',
               '2021-02-14', '2021-02-15', '2021-02-16', '2021-02-17',
               '2021-02-18', '2021-02-19', '2021-02-20', '2021-02-21',
               '2021-02-22', '2021-02-23', '2021-02-24', '2021-02-25',
               '2021-02-26', '2021-02-27', '2021-02-28', '2021-03-01',
               '2021-03-02', '2021-03-03', '2021-03-04', '2021-03-05',
               '2021-03-06', '2021-03-07', '2021-03-08', '2021-03-09',
               '2021-03-10', '2021-03-11', '2021-03-12', '2021-03-13',
               '2021-03-14', '2021-03-15', '2021-03-16', '2021-03-17',
               '2021-03-18', '2021-03-19', '2021-03-20', '2021-03-21',
               '2021-03-22', '2021-03-23', '2021-03-24', '2021-03-25',
               '2021-03-26', '2021-03-27', '2021-03-28', '2021-03-29',
               '2021-03-30', '2021-03-31', '2021-04-01', '2021-04-02',
               '2021-04-03', '2021-04-04', '2021-04-05', '2021-04-06',
               '2021-04-07', '2021-04-08', '2021-04-09', '2021-04-10'],
              dtype='datetime64[ns]', freq='D')

In [226]:
df = pd.DataFrame(range(numero_de_dias), columns=['number'], index=datas)
df.index.name = 'datas'

In [227]:
df

            number
datas
2021-01-01       0
2021-01-02       1
2021-01-03       2
2021-01-04       3
2021-01-05       4
...            ...
2021-04-06      95
2021-04-07      96
2021-04-08      97
2021-04-09      98
2021-04-10      99

[100 rows x 1 columns]

In [228]:
df.index[0]

Timestamp('2021-01-01 00:00:00')

In [229]:
df.index[0].day

1

In [230]:
df.index[0].month

1

In [231]:
df.index[0].year

2021

In [232]:
df[df.index.day == 10]

            number
datas
2021-01-10       9
2021-02-10      40
2021-03-10      68
2021-04-10      99

In [233]:
df['Month'] = df.index.month

In [237]:
import datetime

In [238]:
df[df.index>datetime.datetime(2021, 1, 10)]

            number  Month
datas
2021-01-11      10      1
2021-01-12      11      1
2021-01-13      12      1
2021-01-14      13      1
2021-01-15      14      1
...            ...    ...
2021-04-06      95      4
2021-04-07      96      4
2021-04-08      97      4
2021-04-09      98      4
2021-04-10      99      4

[90 rows x 2 columns]

In [234]:
df

            number  Month
datas
2021-01-01       0      1
2021-01-02       1      1
2021-01-03       2      1
2021-01-04       3      1
2021-01-05       4      1
...            ...    ...
2021-04-06      95      4
2021-04-07      96      4
2021-04-08      97      4
2021-04-09      98      4
2021-04-10      99      4

[100 rows x 2 columns]